zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
/* Private function prototypes -----------------------------------------------*/
static void XSPI_DMARxCplt(MDMA_HandleTypeDef *hmdma);
static void XSPI_DMATxCplt(MDMA_HandleTypeDef *hmdma);
static void XSPI_DMAError(MDMA_HandleTypeDef *hmdma);
static void XSPI_DMAAbortCplt(MDMA_HandleTypeDef *hmdma);
static HAL_StatusTypeDef XSPI_WaitFlagStateUntilTimeout(XSPI_HandleTypeDef *hxspi, uint32_t Flag, FlagStatus State,
                                                        uint32_t Tickstart, uint32_t Timeout);
static void XSPI_Config(XSPI_HandleTypeDef *hxspi, XSPI_RegularCmdTypeDef *cmd, uint32_t FunctionalMode);

/* Exported functions --------------------------------------------------------*/

/** @defgroup XSPI_Exported_Functions XSPI Exported Functions
  * @{
  */

/** @defgroup XSPI_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
===============================================================================
            ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to :
      (+) Initialize the XSPI.
      (+) De-initialize the XSPI.

@endverbatim
  * @{
  */

/**
  * @brief Initialize the XSPI mode according to the specified parameters
  *        in the XSPI_InitTypeDef and initialize the associated handle.
  * @param hxspi XSPI handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Init(XSPI_HandleTypeDef *hxspi)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  /* Check the XSPI handle allocation */
  if (hxspi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_QSPI_ALL_INSTANCE(hxspi->Instance));
  assert_param(IS_XSPI_CLK_PRESCALER(hxspi->Init.ClockPrescaler));
  /* Renamed IS_XSPI_FIFO_THRESHOLD(), FifoThreshold to IS_XSPI_FIFO_THRESHOLDBYTE and FifoThresholdByte respectively
  for better compatibility with ExtMem Manager */
  assert_param(IS_XSPI_FIFO_THRESHOLD_BYTE(hxspi->Init.FifoThresholdByte));
  assert_param(IS_XSPI_SAMPLE_SHIFTING(hxspi->Init.SampleShifting));
  /* FlashSize renamed to MemorySize for compatibility with Ext Mem Manager */
  assert_param(IS_XSPI_MEMORY_SIZE(hxspi->Init.MemorySize));
  assert_param(IS_XSPI_CS_HIGH_TIME_CYCLE(hxspi->Init.ChipSelectHighTimeCycle));
  assert_param(IS_XSPI_CLOCK_MODE(hxspi->Init.ClockMode));
  /* Renamed IS_XSPI_DUAL_FLASH_MODE to IS_XSPI_MEMORY_MODE for better compatibility with ExtMem Manager */
  assert_param(IS_XSPI_MEMORY_MODE(hxspi->Init.MemoryMode));

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hxspi->Lock = HAL_UNLOCKED;

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    /* Reset Callback pointers in HAL_XSPI_STATE_RESET only */
    hxspi->ErrorCallback         = HAL_XSPI_ErrorCallback;
    hxspi->AbortCpltCallback     = HAL_XSPI_AbortCpltCallback;
    hxspi->FifoThresholdCallback = HAL_XSPI_FifoThresholdCallback;
    hxspi->CmdCpltCallback       = HAL_XSPI_CmdCpltCallback;
    hxspi->RxCpltCallback        = HAL_XSPI_RxCpltCallback;
    hxspi->TxCpltCallback        = HAL_XSPI_TxCpltCallback;
    hxspi->RxHalfCpltCallback    = HAL_XSPI_RxHalfCpltCallback;
    hxspi->TxHalfCpltCallback    = HAL_XSPI_TxHalfCpltCallback;
    hxspi->StatusMatchCallback   = HAL_XSPI_StatusMatchCallback;
    hxspi->TimeOutCallback       = HAL_XSPI_TimeOutCallback;

    if (hxspi->MspInitCallback == NULL)
    {
      hxspi->MspInitCallback = HAL_XSPI_MspInit;
    }

    /* Init the low level hardware */
    hxspi->MspInitCallback(hxspi);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    HAL_XSPI_MspInit(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

    /* Configure the default timeout for the XSPI memory access */
    HAL_XSPI_SetTimeout(hxspi, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
  }
  /* Renamed FifoThreshold to FifoThresholdByte for better compatibility with ExtMem Manager for future integration */
  /* Configure XSPI FIFO Threshold */
  MODIFY_REG(hxspi->Instance->CR, QUADSPI_CR_FTHRES,
             ((hxspi->Init.FifoThresholdByte - 1U) << QUADSPI_CR_FTHRES_Pos));

  /* Wait till BUSY flag reset */
  status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_BUSY, RESET, tickstart, hxspi->Timeout);

  if (status == HAL_OK)
  {
    /* Configure XSPI Clock Prescaler and Sample Shift */
    MODIFY_REG(hxspi->Instance->CR, (QUADSPI_CR_PRESCALER | QUADSPI_CR_SSHIFT | QUADSPI_CR_FSEL | QUADSPI_CR_DFM),
               ((hxspi->Init.ClockPrescaler << QUADSPI_CR_PRESCALER_Pos) |
                hxspi->Init.SampleShifting  | hxspi->Init.MemoryMode));

    /* Configure XSPI Memory Size, CS High Time and Clock Mode */
    MODIFY_REG(hxspi->Instance->DCR, (QUADSPI_DCR_FSIZE | QUADSPI_DCR_CSHT | QUADSPI_DCR_CKMODE),
               ((hxspi->Init.MemorySize << QUADSPI_DCR_FSIZE_Pos) |
                ((hxspi->Init.ChipSelectHighTimeCycle - 1U) << QUADSPI_DCR_CSHT_Pos) | hxspi->Init.ClockMode));

    /* Enable the XSPI peripheral */
    HAL_XSPI_ENABLE(hxspi);

    /* Set XSPI error code to none */
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    /* Initialize the XSPI state */
    hxspi->State = HAL_XSPI_STATE_READY;
  }

  /* Release Lock */
  __HAL_UNLOCK(hxspi);

  /* Return function status */
  return status;
}

/**
  * @brief De-Initialize the XSPI peripheral.
  * @param hxspi XSPI handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_DeInit(XSPI_HandleTypeDef *hxspi)
{
  /* Check the XSPI handle allocation */
  if (hxspi == NULL)
  {
    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(hxspi);

  /* Disable the XSPI Peripheral Clock */
  HAL_XSPI_DISABLE(hxspi);

#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
  if (hxspi->MspDeInitCallback == NULL)
  {
    hxspi->MspDeInitCallback = HAL_XSPI_MspDeInit;
  }

