zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
  /* DeInit the low level hardware */
  hxspi->MspDeInitCallback(hxspi);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  HAL_XSPI_MspDeInit(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */

  /* Set XSPI error code to none */
  hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

  /* Initialize the XSPI state */
  hxspi->State = HAL_XSPI_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hxspi);

  return HAL_OK;
}

/**
  * @brief Initialize the XSPI MSP.
  * @param hxspi XSPI handle
  * @retval None
  */
__weak void HAL_XSPI_MspInit(XSPI_HandleTypeDef *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hxspi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_XSPI_MspInit can be implemented in the user file
   */
}

/**
  * @brief DeInitialize the XSPI MSP.
  * @param hxspi XSPI handle
  * @retval None
  */
__weak void HAL_XSPI_MspDeInit(XSPI_HandleTypeDef *hxspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hxspi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_XSPI_MspDeInit can be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup XSPI_Exported_Functions_Group2 Input and Output operation functions
  *  @brief XSPI Transmit/Receive functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to :
      (+) Handle the interrupts.
      (+) Handle the command sequence.
      (+) Transmit data in blocking, interrupt or DMA mode.
      (+) Receive data in blocking, interrupt or DMA mode.
      (+) Manage the auto-polling functional mode.
      (+) Manage the memory-mapped functional mode.

@endverbatim
  * @{
  */

/**
  * @brief Handle XSPI interrupt request.
  * @param hxspi XSPI handle
  * @retval None
  */
void HAL_XSPI_IRQHandler(XSPI_HandleTypeDef *hxspi)
{
  __IO uint32_t *data_reg;
  uint32_t flag = READ_REG(hxspi->Instance->SR);
  uint32_t itsource = READ_REG(hxspi->Instance->CR);

  /* XSPI Fifo Threshold interrupt occurred ----------------------------------*/
  if (((flag & XSPI_FLAG_FT) != 0U) && ((itsource & XSPI_IT_FT) != 0U))
  {
    data_reg = &hxspi->Instance->DR;

    if (hxspi->State == HAL_XSPI_STATE_BUSY_INDIRECT_TX)
    {
      /* Transmission process */
      while (HAL_XSPI_GET_FLAG(hxspi, XSPI_FLAG_FT) != RESET)
      {
        if (hxspi->XferCount > 0U)
        {
          /* Fill the FIFO until the threshold is reached */
          *((__IO uint8_t *)data_reg) = *hxspi->pBuffPtr;
          hxspi->pBuffPtr++;
          hxspi->XferCount--;
        }
        else
        {
          /* No more data available for the transfer */
          /* Disable the XSPI FIFO Threshold Interrupt */
          HAL_XSPI_DISABLE_IT(hxspi, XSPI_IT_FT);
          break;
        }
      }
    }
    else if (hxspi->State == HAL_XSPI_STATE_BUSY_INDIRECT_RX)
    {
      /* Receiving Process */
      while (HAL_XSPI_GET_FLAG(hxspi, XSPI_FLAG_FT) != RESET)
      {
        if (hxspi->XferCount > 0U)
        {
          /* Read the FIFO until the threshold is reached */
          *hxspi->pBuffPtr = *((__IO uint8_t *)data_reg);
          hxspi->pBuffPtr++;
          hxspi->XferCount--;
        }
        else
        {
          /* All data have been received for the transfer */
          /* Disable the XSPI FIFO Threshold Interrupt */
          HAL_XSPI_DISABLE_IT(hxspi, XSPI_IT_FT);
          break;
        }
      }
    }
    else
    {
      /* Nothing to do */
    }

    /* FIFO Threshold callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->FifoThresholdCallback(hxspi);
#else
    HAL_XSPI_FifoThresholdCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }

  /* XSPI Transfer Complete interrupt occurred -------------------------------*/
  else if (((flag & XSPI_FLAG_TC) != 0U) && ((itsource & XSPI_IT_TC) != 0U))
  {
    /* Clear interrupt */
    WRITE_REG(hxspi->Instance->FCR, XSPI_FLAG_TC);

    /* Disable the XSPI FIFO Threshold, Transfer Error and Transfer complete Interrupts */
    HAL_XSPI_DISABLE_IT(hxspi, XSPI_IT_TC | XSPI_IT_TE | XSPI_IT_FT);

    /* Transfer complete callback */
    if (hxspi->State == HAL_XSPI_STATE_BUSY_INDIRECT_TX)
    {
      if ((hxspi->Instance->CR & QUADSPI_CR_DMAEN) != 0U)
      {
        /* Disable the DMA transfer by clearing the DMAEN bit in the XSPI CR register */
        CLEAR_BIT(hxspi->Instance->CR, QUADSPI_CR_DMAEN);

        /* Disable the MDMA channel */
        __HAL_MDMA_DISABLE(hxspi->hmdma);
      }


      /* Change state of XSPI */
      hxspi->State = HAL_XSPI_STATE_READY;

      /* TX Complete callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
      hxspi->TxCpltCallback(hxspi);
#else
      HAL_XSPI_TxCpltCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
    }
    else if (hxspi->State == HAL_XSPI_STATE_BUSY_INDIRECT_RX)
    {
      if ((hxspi->Instance->CR & QUADSPI_CR_DMAEN) != 0U)
      {
        /* Disable the DMA transfer by clearing the DMAEN bit in the XSPI CR register */
        CLEAR_BIT(hxspi->Instance->CR, QUADSPI_CR_DMAEN);

        /* Disable the MDMA channel */
        __HAL_MDMA_DISABLE(hxspi->hmdma);
      }
      else
      {
        data_reg = &hxspi->Instance->DR;
        while (READ_BIT(hxspi->Instance->SR, QUADSPI_SR_FLEVEL) != 0U)
        {
          if (hxspi->XferCount > 0U)
          {
            /* Read the last data received in the FIFO until it is empty */
            *hxspi->pBuffPtr = *((__IO uint8_t *)data_reg);
            hxspi->pBuffPtr++;
            hxspi->XferCount--;
          }
          else
          {
            /* All data have been received for the transfer */
            break;
          }
        }
      }


