zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
      /* Change state of XSPI */
      hxspi->State = HAL_XSPI_STATE_READY;

      /* RX Complete callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
      hxspi->RxCpltCallback(hxspi);
#else
      HAL_XSPI_RxCpltCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
    }
    else if (hxspi->State == HAL_XSPI_STATE_BUSY)
    {
      /* Change state of XSPI */
      hxspi->State = HAL_XSPI_STATE_READY;

      /* Command Complete callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
      hxspi->CmdCpltCallback(hxspi);
#else
      HAL_XSPI_CmdCpltCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
 */
    }
    else if (hxspi->State == HAL_XSPI_STATE_ABORT)
    {
      /* Reset functional mode configuration to indirect write mode by default */
      CLEAR_BIT(hxspi->Instance->CCR, QUADSPI_CCR_FMODE);

      /* Change state of XSPI */
      hxspi->State = HAL_XSPI_STATE_READY;

      if (hxspi->ErrorCode == HAL_XSPI_ERROR_NONE)
      {
        /* Abort called by the user */

        /* Abort Complete callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
        hxspi->AbortCpltCallback(hxspi);
#else
        HAL_XSPI_AbortCpltCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
      }
      else
      {
        /* Abort due to an error (eg :  MDMA error) */

        /* Error callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
        hxspi->ErrorCallback(hxspi);
#else
        HAL_XSPI_ErrorCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
      }
    }
    else
    {
      /* Nothing to do */
    }
  }

  /* XSPI Status Match interrupt occurred ------------------------------------*/
  else if (((flag & XSPI_FLAG_SM) != 0U) && ((itsource & XSPI_IT_SM) != 0U))
  {
    /* Clear interrupt */
    WRITE_REG(hxspi->Instance->FCR, XSPI_FLAG_SM);

    /* Check if the automatic poll mode stop is activated */
    if (READ_BIT(hxspi->Instance->CR, QUADSPI_CR_APMS) != 0U)
    {
      /* Disable the XSPI Transfer Error and Status Match Interrupts */
      HAL_XSPI_DISABLE_IT(hxspi, (XSPI_IT_SM | XSPI_IT_TE));

      /* Change state of XSPI */
      hxspi->State = HAL_XSPI_STATE_READY;
    }

    /* Status match callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->StatusMatchCallback(hxspi);
#else
    HAL_XSPI_StatusMatchCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }

  /* XSPI Transfer Error interrupt occurred ----------------------------------*/
  else if (((flag & XSPI_FLAG_TE) != 0U) && ((itsource & XSPI_IT_TE) != 0U))
  {
    /* Clear interrupt */
    WRITE_REG(hxspi->Instance->FCR, XSPI_FLAG_TE);

    /* Disable all the XSPI Interrupts */
    HAL_XSPI_DISABLE_IT(hxspi, XSPI_IT_SM | XSPI_IT_TC | XSPI_IT_TE | XSPI_IT_FT);

    /* Set error code */
    hxspi->ErrorCode |= HAL_XSPI_ERROR_TRANSFER;

    if ((hxspi->Instance->CR & QUADSPI_CR_DMAEN) != 0U)
    {
      /* Disable the DMA transfer by clearing the DMAEN bit in the XSPI CR register */
      CLEAR_BIT(hxspi->Instance->CR, QUADSPI_CR_DMAEN);

      /* Disable the MDMA channel */
      hxspi->hmdma->XferAbortCallback = XSPI_DMAAbortCplt;
      if (HAL_MDMA_Abort_IT(hxspi->hmdma) != HAL_OK)
      {
        /* Set error code to DMA */
        hxspi->ErrorCode |= HAL_XSPI_ERROR_DMA;

        /* Change state of XSPI */
        hxspi->State = HAL_XSPI_STATE_READY;

        /* Error callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
        hxspi->ErrorCallback(hxspi);
#else
        HAL_XSPI_ErrorCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
      }
    }
    else
    {
      /* Change state of XSPI */
      hxspi->State = HAL_XSPI_STATE_READY;

      /* Error callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
      hxspi->ErrorCallback(hxspi);
#else
      HAL_XSPI_ErrorCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
    }
  }

  /* XSPI Timeout interrupt occurred -----------------------------------------*/
  else if (((flag & XSPI_FLAG_TO) != 0U) && ((itsource & XSPI_IT_TO) != 0U))
  {
    /* Clear interrupt */
    WRITE_REG(hxspi->Instance->FCR, XSPI_FLAG_TO);

    /* Timeout callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->TimeOutCallback(hxspi);
#else
    HAL_XSPI_TimeOutCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }

  else
  {
    /* Nothing to do */
  }
}

/**
  * @brief Set the command configuration.
  * @param hxspi XSPI handle
  * @param cmd : structure that contains the command configuration information
  * @param Timeout Timeout duration
  * @note   This function is used only in Indirect Read or Write Modes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Command(XSPI_HandleTypeDef *hxspi, XSPI_RegularCmdTypeDef *cmd, uint32_t Timeout)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  /* Renamed IS_XSPI_DUAL_FLASH_MODE to IS_XSPI_MEMORY_MODE for better compatibility with ExtMem Manager */
  assert_param(IS_XSPI_MEMORY_MODE(hxspi->Init.MemoryMode));

  if (hxspi->Init.MemoryMode != HAL_XSPI_DUAL_MEM)
  {
    assert_param(IS_XSPI_IO_SELECT(cmd->IOSelect));
    MODIFY_REG(hxspi->Instance->CR, QUADSPI_CR_FSEL, cmd->IOSelect);
  }

  /* Check the parameters */
  assert_param(IS_XSPI_INSTRUCTION_MODE(cmd->InstructionMode));
  if (cmd->InstructionMode != XSPI_INSTRUCTION_NONE)
  {
    assert_param(IS_XSPI_INSTRUCTION(cmd->Instruction));
  }

