zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
  assert_param(IS_XSPI_ADDRESS_MODE(cmd->AddressMode));
  if (cmd->AddressMode != XSPI_ADDRESS_NONE)
  {
    /* Renamed IS_XSPI_ADDRESS_SIZE() to IS_XSPI_ADDRESS_WIDTH() for better compatibility with ExtMem Manager */
    assert_param(IS_XSPI_ADDRESS_WIDTH(cmd->AddressWidth));
  }

  assert_param(IS_XSPI_ALT_BYTES_MODE(cmd->AlternateByteMode));
  if (cmd->AlternateByteMode != XSPI_ALT_BYTES_NONE)
  {
    /* Renamed IS_XSPI_ALT_BYTES_SIZE() to IS_XSPI_ALT_BYTES_WIDTH() for better compatibility with
    ExtMem Manager */
    assert_param(IS_XSPI_ALT_BYTES_WIDTH(cmd->AlternateBytesWidth));
  }

  assert_param(IS_XSPI_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_XSPI_DATA_MODE(cmd->DataMode));

  assert_param(IS_XSPI_DTR_MODE(cmd->DTRMode));
  assert_param(IS_XSPI_DHHC(cmd->DelayHoldHalfCycle));
  assert_param(IS_XSPI_SIOO_MODE(cmd->SIOOMode));

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    /* Update XSPI state */
    hxspi->State = HAL_XSPI_STATE_BUSY;

    /* Wait till BUSY flag reset */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_BUSY, RESET, tickstart, Timeout);

    if (status == HAL_OK)
    {
      /* Call the configuration function */
      XSPI_Config(hxspi, cmd, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

      if (cmd->DataMode == XSPI_DATA_NONE)
      {
        /* When there is no data phase, the transfer start as soon as the configuration is done
        so wait until TC flag is set to go back in idle state */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_TC, SET, tickstart, Timeout);

        if (status == HAL_OK)
        {
          HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TC);

          /* Update XSPI state */
          hxspi->State = HAL_XSPI_STATE_READY;
        }
      }
      else
      {
        /* Update XSPI state */
        hxspi->State = HAL_XSPI_STATE_READY;
      }
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hxspi);

  /* Return function status */
  return status;
}

/**
  * @brief Set the command configuration in interrupt mode.
  * @param hxspi XSPI handle
  * @param cmd structure that contains the command configuration information
  * @note   This function is used only in Indirect Read or Write Modes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Command_IT(XSPI_HandleTypeDef *hxspi, XSPI_RegularCmdTypeDef *cmd)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  /* Renamed IS_XSPI_DUAL_FLASH_MODE to IS_XSPI_MEMORY_MODE for better compatibility with ExtMem Manager */
  assert_param(IS_XSPI_MEMORY_MODE(hxspi->Init.MemoryMode));

  if (hxspi->Init.MemoryMode != HAL_XSPI_DUAL_MEM)
  {
    assert_param(IS_XSPI_IO_SELECT(cmd->IOSelect));
    MODIFY_REG(hxspi->Instance->CR, QUADSPI_CR_FSEL, cmd->IOSelect);
  }

  /* Check the parameters */
  assert_param(IS_XSPI_INSTRUCTION_MODE(cmd->InstructionMode));
  if (cmd->InstructionMode != XSPI_INSTRUCTION_NONE)
  {
    assert_param(IS_XSPI_INSTRUCTION(cmd->Instruction));
  }

  assert_param(IS_XSPI_ADDRESS_MODE(cmd->AddressMode));
  if (cmd->AddressMode != XSPI_ADDRESS_NONE)
  {
    /* Renamed IS_XSPI_ADDRESS_SIZE() to IS_XSPI_ADDRESS_WIDTH() for better compatibility with ExtMem Manager */
    assert_param(IS_XSPI_ADDRESS_WIDTH(cmd->AddressWidth));
  }

  assert_param(IS_XSPI_ALT_BYTES_MODE(cmd->AlternateByteMode));
  if (cmd->AlternateByteMode != XSPI_ALT_BYTES_NONE)
  {
    /* Renamed IS_XSPI_ALT_BYTES_SIZE() to IS_XSPI_ALT_BYTES_WIDTH() for better compatibility with
    ExtMem Manager */
    assert_param(IS_XSPI_ALT_BYTES_WIDTH(cmd->AlternateBytesWidth));
  }

  assert_param(IS_XSPI_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_XSPI_DATA_MODE(cmd->DataMode));

  assert_param(IS_XSPI_DTR_MODE(cmd->DTRMode));
  assert_param(IS_XSPI_DHHC(cmd->DelayHoldHalfCycle));
  assert_param(IS_XSPI_SIOO_MODE(cmd->SIOOMode));

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    /* Update XSPI state */
    hxspi->State = HAL_XSPI_STATE_BUSY;

    /* Wait till BUSY flag reset */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_BUSY, RESET, tickstart, hxspi->Timeout);

    if (status == HAL_OK)
    {
      if (cmd->DataMode == XSPI_DATA_NONE)
      {
        /* Clear interrupt */
        HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TE | XSPI_FLAG_TC);
      }

      /* Call the configuration function */
      XSPI_Config(hxspi, cmd, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

      if (cmd->DataMode == XSPI_DATA_NONE)
      {
        /* When there is no data phase, the transfer start as soon as the configuration is done
        so activate TC and TE interrupts */
        /* Process unlocked */
        __HAL_UNLOCK(hxspi);

        /* Enable the XSPI Transfer Error Interrupt */
        HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TE | XSPI_IT_TC);
      }
      else
      {
        /* Update XSPI state */
        hxspi->State = HAL_XSPI_STATE_READY;

        /* Process unlocked */
        __HAL_UNLOCK(hxspi);
      }
    }
    else
    {
      /* Process unlocked */
      __HAL_UNLOCK(hxspi);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hxspi);
  }

  /* Return function status */
  return status;
}

/**
  * @brief Transmit an amount of data in blocking mode.
  * @param hxspi XSPI handle
  * @param pData pointer to data buffer
  * @param Timeout Timeout duration
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Transmit(XSPI_HandleTypeDef *hxspi, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();
  __IO uint32_t *data_reg = &hxspi->Instance->DR;

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    if (pData != NULL)
    {
      /* Update state */
      hxspi->State = HAL_XSPI_STATE_BUSY_INDIRECT_TX;

      /* Configure counters and size of the handle */
      hxspi->XferCount = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->XferSize = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->pBuffPtr = pData;

      /* Configure XSPI: CCR register with functional as indirect write */
      MODIFY_REG(hxspi->Instance->CCR, QUADSPI_CCR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

      while (hxspi->XferCount > 0U)
      {
        /* Wait until FT flag is set to send data */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_FT, SET, tickstart, Timeout);

        if (status != HAL_OK)
        {
          break;
        }

        *((__IO uint8_t *)data_reg) = *hxspi->pBuffPtr;
        hxspi->pBuffPtr++;
        hxspi->XferCount--;
      }

      if (status == HAL_OK)
      {
        /* Wait until TC flag is set to go back in idle state */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_TC, SET, tickstart, Timeout);

        if (status == HAL_OK)
        {
          /* Clear Transfer Complete bit */
          HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TC);

