zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
        }
      }

      /* Update XSPI state */
      hxspi->State = HAL_XSPI_STATE_READY;
    }
    else
    {
      hxspi->ErrorCode |= HAL_XSPI_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hxspi);

  return status;
}


/**
  * @brief Receive an amount of data in blocking mode.
  * @param hxspi XSPI handle
  * @param pData pointer to data buffer
  * @param Timeout Timeout duration
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Receive(XSPI_HandleTypeDef *hxspi, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();
  uint32_t addr_reg = READ_REG(hxspi->Instance->AR);
  __IO uint32_t *data_reg = &hxspi->Instance->DR;

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    if (pData != NULL)
    {
      /* Update state */
      hxspi->State = HAL_XSPI_STATE_BUSY_INDIRECT_RX;

      /* Configure counters and size of the handle */
      hxspi->XferCount = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->XferSize = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->pBuffPtr = pData;

      /* Configure XSPI: CCR register with functional as indirect read */
      MODIFY_REG(hxspi->Instance->CCR, QUADSPI_CCR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);

      /* Start the transfer by re-writing the address in AR register */
      WRITE_REG(hxspi->Instance->AR, addr_reg);

      while (hxspi->XferCount > 0U)
      {
        /* Wait until FT or TC flag is set to read received data */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, (XSPI_FLAG_FT | XSPI_FLAG_TC), SET, tickstart, Timeout);

        if (status != HAL_OK)
        {
          break;
        }

        *hxspi->pBuffPtr = *((__IO uint8_t *)data_reg);
        hxspi->pBuffPtr++;
        hxspi->XferCount--;
      }

      if (status == HAL_OK)
      {
        /* Wait until TC flag is set to go back in idle state */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_TC, SET, tickstart, Timeout);

        if (status == HAL_OK)
        {
          /* Clear Transfer Complete bit */
          HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TC);

        }
      }

      /* Update XSPI state */
      hxspi->State = HAL_XSPI_STATE_READY;
    }
    else
    {
      hxspi->ErrorCode |= HAL_XSPI_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hxspi);

  return status;
}

/**
  * @brief  Send an amount of data in non-blocking mode with interrupt.
  * @param  hxspi XSPI handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Transmit_IT(XSPI_HandleTypeDef *hxspi, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    if (pData != NULL)
    {
      /* Update state */
      hxspi->State = HAL_XSPI_STATE_BUSY_INDIRECT_TX;

      /* Configure counters and size of the handle */
      hxspi->XferCount = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->XferSize = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->pBuffPtr = pData;

      /* Clear interrupt */
      HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TE | XSPI_FLAG_TC);

      /* Configure XSPI: CCR register with functional as indirect write */
      MODIFY_REG(hxspi->Instance->CCR, QUADSPI_CCR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

      /* Process unlocked */
      __HAL_UNLOCK(hxspi);

      /* Enable the XSPI transfer error, FIFO threshold and transfer complete Interrupts */
      HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TE | XSPI_IT_FT | XSPI_IT_TC);
    }
    else
    {
      hxspi->ErrorCode |= HAL_XSPI_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hxspi);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hxspi);
  }

  return status;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with interrupt.
  * @param  hxspi XSPI handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Receive_IT(XSPI_HandleTypeDef *hxspi, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t addr_reg = READ_REG(hxspi->Instance->AR);

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    if (pData != NULL)
    {
      /* Update state */
      hxspi->State = HAL_XSPI_STATE_BUSY_INDIRECT_RX;

      /* Configure counters and size of the handle */
      hxspi->XferCount = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->XferSize = READ_REG(hxspi->Instance->DLR) + 1U;
      hxspi->pBuffPtr = pData;

      /* Clear interrupt */
      HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TE | XSPI_FLAG_TC);

      /* Configure XSPI: CCR register with functional as indirect read */
      MODIFY_REG(hxspi->Instance->CCR, QUADSPI_CCR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);

      /* Start the transfer by re-writing the address in AR register */
      WRITE_REG(hxspi->Instance->AR, addr_reg);

      /* Process unlocked */
      __HAL_UNLOCK(hxspi);

      /* Enable the XSPI transfer error, FIFO threshold and transfer complete Interrupts */
      HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TE | XSPI_IT_FT | XSPI_IT_TC);
    }
    else
    {
      hxspi->ErrorCode |= HAL_XSPI_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hxspi);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hxspi);
  }

  return status;
}

/**
  * @brief  Send an amount of data in non-blocking mode with DMA.
  * @param  hxspi XSPI handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Transmit_DMA(XSPI_HandleTypeDef *hxspi, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t data_size = (READ_REG(hxspi->Instance->DLR) + 1U);

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    /* Clear the error code */
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

