zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
    if (pData != NULL)
    {
      /* Configure counters of the handle */
      hxspi->XferCount = data_size;

      /* Update state */
      hxspi->State = HAL_XSPI_STATE_BUSY_INDIRECT_TX;

      /* Clear interrupt */
      HAL_XSPI_CLEAR_FLAG(hxspi, (XSPI_FLAG_TE | XSPI_FLAG_TC));

      /* Configure size and pointer of the handle */
      hxspi->XferSize = hxspi->XferCount;
      hxspi->pBuffPtr = pData;

      /* Configure XSPI: CCR register with functional mode as indirect write */
      MODIFY_REG(hxspi->Instance->CCR, QUADSPI_CCR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

      /* Set the XSPI MDMA transfer complete callback */
      hxspi->hmdma->XferCpltCallback = XSPI_DMATxCplt;

      /* Set the MDMA error callback */
      hxspi->hmdma->XferErrorCallback = XSPI_DMAError;

      /* Clear the MDMA abort callback */
      hxspi->hmdma->XferAbortCallback = NULL;

      /* In Transmit mode , the MDMA destination is the XSPI DR register :
         Force the MDMA Destination Increment to disable */
      MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_DINC | MDMA_CTCR_DINCOS), MDMA_DEST_INC_DISABLE);

      /* Update MDMA configuration with the correct SourceInc field for Write operation */
      if (hxspi->hmdma->Init.SourceDataSize == MDMA_SRC_DATASIZE_BYTE)
      {
        MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_SINC | MDMA_CTCR_SINCOS), MDMA_SRC_INC_BYTE);
      }
      else if (hxspi->hmdma->Init.SourceDataSize == MDMA_SRC_DATASIZE_HALFWORD)
      {
        MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_SINC | MDMA_CTCR_SINCOS), MDMA_SRC_INC_HALFWORD);
      }
      else if (hxspi->hmdma->Init.SourceDataSize == MDMA_SRC_DATASIZE_WORD)
      {
        MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_SINC | MDMA_CTCR_SINCOS), MDMA_SRC_INC_WORD);
      }
      else
      {
        /* in case of incorrect source data size */
        hxspi->ErrorCode |= HAL_XSPI_ERROR_DMA;
        status = HAL_ERROR;
      }

      /* Enable the XSPI transmit MDMA */
      if (HAL_MDMA_Start_IT(hxspi->hmdma, (uint32_t)pData, (uint32_t)&hxspi->Instance->DR, hxspi->XferSize,
                            1) == HAL_OK)
      {
        /* Process unlocked */
        __HAL_UNLOCK(hxspi);

        /* Enable the XSPI transfer error Interrupt */
        HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TE);

        /* Enable the MDMA transfer by setting the DMAEN bit not needed for MDMA*/
      }
      else
      {
        status = HAL_ERROR;
        hxspi->ErrorCode |= HAL_XSPI_ERROR_DMA;
        hxspi->State = HAL_XSPI_STATE_READY;

        /* Process unlocked */
        __HAL_UNLOCK(hxspi);
      }
    }
    else
    {
      hxspi->ErrorCode |= HAL_XSPI_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hxspi);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hxspi);
  }

  return status;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with DMA.
  * @param  hxspi XSPI handle
  * @param  pData pointer to data buffer.
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Receive_DMA(XSPI_HandleTypeDef *hxspi, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t addr_reg = READ_REG(hxspi->Instance->AR);
  uint32_t data_size = (READ_REG(hxspi->Instance->DLR) + 1U);

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    /* Clear the error code */
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    if (pData != NULL)
    {
      /* Configure counters of the handle */
      hxspi->XferCount = data_size;
      /* Update state */
      hxspi->State = HAL_XSPI_STATE_BUSY_INDIRECT_RX;

      /* Clear interrupt */
      HAL_XSPI_CLEAR_FLAG(hxspi, (XSPI_FLAG_TE | XSPI_FLAG_TC));

      /* Configure size and pointer of the handle */
      hxspi->XferSize = hxspi->XferCount;
      hxspi->pBuffPtr = pData;

      /* Set the XSPI DMA transfer complete callback */
      hxspi->hmdma->XferCpltCallback = XSPI_DMARxCplt;

      /* Set the MDMA error callback */
      hxspi->hmdma->XferErrorCallback = XSPI_DMAError;

      /* Clear the MDMA abort callback */
      hxspi->hmdma->XferAbortCallback = NULL;

      /* In Receive mode , the MDMA source is the XSPI DR register : Force the MDMA Source Increment to disable */
      MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_SINC | MDMA_CTCR_SINCOS), MDMA_SRC_INC_DISABLE);

      /* Update MDMA configuration with the correct DestinationInc field for read operation */
      if (hxspi->hmdma->Init.DestDataSize == MDMA_DEST_DATASIZE_BYTE)
      {
        MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_DINC | MDMA_CTCR_DINCOS), MDMA_DEST_INC_BYTE);
      }
      else if (hxspi->hmdma->Init.DestDataSize == MDMA_DEST_DATASIZE_HALFWORD)
      {
        MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_DINC | MDMA_CTCR_DINCOS), MDMA_DEST_INC_HALFWORD);
      }
      else if (hxspi->hmdma->Init.DestDataSize == MDMA_DEST_DATASIZE_WORD)
      {
        MODIFY_REG(hxspi->hmdma->Instance->CTCR, (MDMA_CTCR_DINC | MDMA_CTCR_DINCOS), MDMA_DEST_INC_WORD);
      }
      else
      {
        /* in case of incorrect destination data size */
        hxspi->ErrorCode |= HAL_XSPI_ERROR_DMA;
        status = HAL_ERROR;
      }

      /* XSPI need to be configured to indirect mode before starting
         the MDMA to avoid premature triggering for the MDMA transfer */
      /* Configure XSPI: CCR register with functional as indirect read */
      MODIFY_REG(hxspi->Instance->CCR, QUADSPI_CCR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);

      /* Start the transfer by re-writing the address in AR register */
      WRITE_REG(hxspi->Instance->AR, addr_reg);

      /* Enable the MDMA */
      if (HAL_MDMA_Start_IT(hxspi->hmdma, (uint32_t)&hxspi->Instance->DR, (uint32_t)pData, hxspi->XferSize, 1)
          == HAL_OK)
      {
        /* Process unlocked */
        __HAL_UNLOCK(hxspi);

