zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
        /* Enable the XSPI transfer error Interrupt */
        HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TE);

        /* Enable the MDMA transfer by setting the DMAEN bit in the XSPI CR register */
        SET_BIT(hxspi->Instance->CR, QUADSPI_CR_DMAEN);
      }
      else
      {
        status = HAL_ERROR;
        hxspi->ErrorCode |= HAL_XSPI_ERROR_DMA;
        hxspi->State = HAL_XSPI_STATE_READY;

        /* Process unlocked */
        __HAL_UNLOCK(hxspi);
      }
    }
    else
    {
      hxspi->ErrorCode |= HAL_XSPI_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hxspi);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hxspi);
  }

  return status;
}

/**
  * @brief  Configure the XSPI Automatic Polling Mode in blocking mode.
  * @param  hxspi XSPI handle
  * @param  cfg structure that contains the polling configuration information.
  * @param  Timeout Timeout duration
  * @note   This function is used only in Automatic Polling Mode.
            XSPI_RegularCmdTypeDef ConfigCmd defined in hal_xspi.h needs to be populated by application code before
            invoking below APIs HAL_XSPI_AutoPolling()
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_AutoPolling(XSPI_HandleTypeDef *hxspi, XSPI_AutoPollingTypeDef *cfg, uint32_t Timeout)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  /* Renamed IS_XSPI_DUAL_FLASH_MODE to IS_XSPI_MEMORY_MODE for better compatibility with ExtMem Manager */
  assert_param(IS_XSPI_MEMORY_MODE(hxspi->Init.MemoryMode));

  if (hxspi->Init.MemoryMode != HAL_XSPI_DUAL_MEM)
  {
    assert_param(IS_XSPI_IO_SELECT(ConfigCmd.IOSelect));
    MODIFY_REG(hxspi->Instance->CR, QUADSPI_CR_FSEL, ConfigCmd.IOSelect);
  }

  assert_param(IS_XSPI_INSTRUCTION_MODE(ConfigCmd.InstructionMode));
  if (ConfigCmd.InstructionMode != XSPI_INSTRUCTION_NONE)
  {
    assert_param(IS_XSPI_INSTRUCTION(ConfigCmd.Instruction));
  }

  assert_param(IS_XSPI_ADDRESS_MODE(ConfigCmd.AddressMode));
  if (ConfigCmd.AddressMode != XSPI_ADDRESS_NONE)
  {
    /* Renamed IS_XSPI_ADDRESS_SIZE() to IS_XSPI_ADDRESS_WIDTH() for better compatibility with ExtMem Manager */
    assert_param(IS_XSPI_ADDRESS_WIDTH(ConfigCmd.AddressWidth));
  }

  assert_param(IS_XSPI_ALT_BYTES_MODE(ConfigCmd.AlternateByteMode));
  if (ConfigCmd.AlternateByteMode != XSPI_ALT_BYTES_NONE)
  {
    /* Renamed IS_XSPI_ALT_BYTES_SIZE() to IS_XSPI_ALT_BYTES_WIDTH() for better compatibility with
    ExtMem Manager */
    assert_param(IS_XSPI_ALT_BYTES_WIDTH(ConfigCmd.AlternateBytesWidth));
  }

  assert_param(IS_XSPI_DUMMY_CYCLES(ConfigCmd.DummyCycles));
  assert_param(IS_XSPI_DATA_MODE(ConfigCmd.DataMode));

  assert_param(IS_XSPI_DTR_MODE(ConfigCmd.DTRMode));
  assert_param(IS_XSPI_DHHC(ConfigCmd.DelayHoldHalfCycle));
  assert_param(IS_XSPI_SIOO_MODE(ConfigCmd.SIOOMode));

  assert_param(IS_XSPI_INTERVAL(cfg->IntervalTime));
  assert_param(IS_XSPI_MATCH_MODE(cfg->MatchMode));

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    hxspi->ErrorCode = HAL_XSPI_ERROR_NONE;

    /* Update state */
    hxspi->State = HAL_XSPI_STATE_BUSY_AUTO_POLLING;

    /* Wait till BUSY flag reset */
    status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_BUSY, RESET, tickstart, Timeout);

    if (status == HAL_OK)
    {
      /* Configure XSPI: PSMAR register with the status match value */
      WRITE_REG(hxspi->Instance->PSMAR, cfg->MatchValue);

      /* Configure XSPI: PSMKR register with the status mask value */
      WRITE_REG(hxspi->Instance->PSMKR, cfg->MatchMask);

      /* Configure XSPI: PIR register with the interval value */
      WRITE_REG(hxspi->Instance->PIR, cfg->IntervalTime);

      /* Configure XSPI: CR register with Match mode and Automatic stop enabled
      (otherwise there will be an infinite loop in blocking mode) */
      MODIFY_REG(hxspi->Instance->CR, (QUADSPI_CR_PMM | QUADSPI_CR_APMS),
                 (cfg->MatchMode | XSPI_AUTOMATIC_STOP_ENABLE));

      /* Call the configuration function */
      XSPI_Config(hxspi, &ConfigCmd, XSPI_FUNCTIONAL_MODE_AUTO_POLLING);

      /* Wait until SM flag is set to go back in idle state */
      status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_SM, SET, tickstart, Timeout);

      if (status == HAL_OK)
      {
        HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_SM);

        /* Update state */
        hxspi->State = HAL_XSPI_STATE_READY;
      }
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hxspi);

  /* Return function status */
  return status;
}

/**
  * @brief  Configure the XSPI Automatic Polling Mode in non-blocking mode.
  * @param  hxspi XSPI handle
  * @param  cfg structure that contains the polling configuration information.
  * @note   This function is used only in Automatic Polling Mode.
            XSPI_RegularCmdTypeDef ConfigCmd defined in hal_xspi.h needs to be populated by application code before
            invoking below APIs HAL_XSPI_AutoPolling_IT()
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_AutoPolling_IT(XSPI_HandleTypeDef *hxspi, XSPI_AutoPollingTypeDef *cfg)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  /* Renamed IS_XSPI_DUAL_FLASH_MODE to IS_XSPI_MEMORY_MODE for better compatibility with ExtMem Manager */
  assert_param(IS_XSPI_MEMORY_MODE(hxspi->Init.MemoryMode));

  if (hxspi->Init.MemoryMode != HAL_XSPI_DUAL_MEM)
  {
    assert_param(IS_XSPI_IO_SELECT(ConfigCmd.IOSelect));
    MODIFY_REG(hxspi->Instance->CR, QUADSPI_CR_FSEL, ConfigCmd.IOSelect);
  }

  assert_param(IS_XSPI_INSTRUCTION_MODE(ConfigCmd.InstructionMode));
  if (ConfigCmd.InstructionMode != XSPI_INSTRUCTION_NONE)
  {
    assert_param(IS_XSPI_INSTRUCTION(ConfigCmd.Instruction));
  }

  assert_param(IS_XSPI_ADDRESS_MODE(ConfigCmd.AddressMode));
  if (ConfigCmd.AddressMode != XSPI_ADDRESS_NONE)
  {
    /* Renamed IS_XSPI_ADDRESS_SIZE() to IS_XSPI_ADDRESS_WIDTH() for better compatibility with ExtMem Manager */
    assert_param(IS_XSPI_ADDRESS_WIDTH(ConfigCmd.AddressWidth));
  }

  assert_param(IS_XSPI_ALT_BYTES_MODE(ConfigCmd.AlternateByteMode));
  if (ConfigCmd.AlternateByteMode != XSPI_ALT_BYTES_NONE)
  {
    /* Renamed IS_XSPI_ALT_BYTES_SIZE() to IS_XSPI_ALT_BYTES_WIDTH() for better compatibility with
    ExtMem Manager */
    assert_param(IS_XSPI_ALT_BYTES_WIDTH(ConfigCmd.AlternateBytesWidth));
  }

  assert_param(IS_XSPI_DUMMY_CYCLES(ConfigCmd.DummyCycles));
  assert_param(IS_XSPI_DATA_MODE(ConfigCmd.DataMode));

  assert_param(IS_XSPI_DTR_MODE(ConfigCmd.DTRMode));
  assert_param(IS_XSPI_DHHC(ConfigCmd.DelayHoldHalfCycle));
  assert_param(IS_XSPI_SIOO_MODE(ConfigCmd.SIOOMode));

