zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
    if (HAL_XSPI_GET_FLAG(hxspi, XSPI_FLAG_BUSY) != RESET)
    {
      /* Configure XSPI: CR register with Abort request */
      SET_BIT(hxspi->Instance->CR, QUADSPI_CR_ABORT);

      /* Wait until TC flag is set to go back in idle state */
      status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_TC, SET, tickstart, hxspi->Timeout);

      if (status == HAL_OK)
      {
        HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TC);

        /* Wait until BUSY flag is reset */
        status = XSPI_WaitFlagStateUntilTimeout(hxspi, XSPI_FLAG_BUSY, RESET, tickstart, hxspi->Timeout);
      }

      if (status == HAL_OK)
      {
        /* Reset functional mode configuration to indirect write mode by default */
        CLEAR_BIT(hxspi->Instance->CCR, QUADSPI_CCR_FMODE);

        /* Update state */
        hxspi->State = HAL_XSPI_STATE_READY;
      }
    }
    else
    {
      /* Update state */
      hxspi->State = HAL_XSPI_STATE_READY;
    }
  }

  return status;
}

/**
  * @brief  Abort the current transmission (non-blocking function)
  * @param  hxspi XSPI handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_Abort_IT(XSPI_HandleTypeDef *hxspi)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check if the state is in one of the busy states */
  if (((uint32_t)hxspi->State & 0x2U) != 0U)
  {
    /* Process unlocked */
    __HAL_UNLOCK(hxspi);

    /* Update XSPI state */
    hxspi->State = HAL_XSPI_STATE_ABORT;

    /* Disable all interrupts */
    HAL_XSPI_DISABLE_IT(hxspi, (XSPI_IT_TO | XSPI_IT_SM | XSPI_IT_FT | XSPI_IT_TC | XSPI_IT_TE));

    if ((hxspi->Instance->CR & QUADSPI_CR_DMAEN) != 0U)
    {
      /* Disable the DMA transfer by clearing the DMAEN bit in the XSPI CR register */
      CLEAR_BIT(hxspi->Instance->CR, QUADSPI_CR_DMAEN);

      /* Abort MDMA channel */
      hxspi->hmdma->XferAbortCallback = XSPI_DMAAbortCplt;
      if (HAL_MDMA_Abort_IT(hxspi->hmdma) != HAL_OK)
      {
        /* Change state of XSPI */
        hxspi->State = HAL_XSPI_STATE_READY;

        /* Abort Complete callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
        hxspi->AbortCpltCallback(hxspi);
#else
        HAL_XSPI_AbortCpltCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
      }
    }
    else
    {
      if (HAL_XSPI_GET_FLAG(hxspi, XSPI_FLAG_BUSY) != RESET)
      {
        /* Clear interrupt */
        HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TC);

        /* Enable the XSPI Transfer Complete Interrupt */
        HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TC);

        /* Configure XSPI: CR register with Abort request */
        SET_BIT(hxspi->Instance->CR, QUADSPI_CR_ABORT);
      }
      else
      {
        /* Change state of XSPI */
        hxspi->State = HAL_XSPI_STATE_READY;
      }
    }
  }
  return status;
}

/** @brief Set XSPI timeout.
  * @param  hxspi XSPI handle.
  * @param  Timeout Timeout for the XSPI memory access.
  * @retval None
  */
void HAL_XSPI_SetTimeout(XSPI_HandleTypeDef *hxspi, uint32_t Timeout)
{
  hxspi->Timeout = Timeout;
}

/** @brief Set XSPI Fifo threshold.
  * @param  hxspi XSPI handle.
  * @param  Threshold Threshold of the Fifo (value between 1 and 16).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_XSPI_SetFifoThreshold(XSPI_HandleTypeDef *hxspi, uint32_t Threshold)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hxspi);

  if (hxspi->State == HAL_XSPI_STATE_READY)
  {
    /* Synchronize init structure with new FIFO threshold value */
    /* Renamed FifoThreshold to FifoThresholdByte for better compatibility with ExtMem Manager for future
    integration */
    hxspi->Init.FifoThresholdByte = Threshold;

    /* Configure XSPI FIFO Threshold */
    MODIFY_REG(hxspi->Instance->CR, QUADSPI_CR_FTHRES,
               ((hxspi->Init.FifoThresholdByte - 1U) << QUADSPI_CR_FTHRES_Pos));
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hxspi);

  /* Return function status */
  return status;
}

/** @brief Get XSPI Fifo threshold.
  * @param  hxspi XSPI handle.
  * @retval Fifo threshold (value between 1 and 16)
  */
uint32_t HAL_XSPI_GetFifoThreshold(const XSPI_HandleTypeDef *hxspi)
{
  return ((READ_BIT(hxspi->Instance->CR, QUADSPI_CR_FTHRES) >> QUADSPI_CR_FTHRES_Pos) + 1U);
}

/**
  * @}
  */

/** @defgroup XSPI_Private_Functions XSPI Private Functions
  * @{
  */

/**
  * @brief  DMA XSPI receive process complete callback.
  * @param  hmdma MDMA handle
  * @retval None
  */
static void XSPI_DMARxCplt(MDMA_HandleTypeDef *hmdma)
{
  XSPI_HandleTypeDef *hxspi = (XSPI_HandleTypeDef *)(hmdma->Parent);
  hxspi->XferCount = 0U;

  /* Enable the XSPI transfer complete Interrupt */
  HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TC);
}

/**
  * @brief  DMA XSPI transmit process complete callback.
  * @param  hmdma MDMA handle
  * @retval None
  */
static void XSPI_DMATxCplt(MDMA_HandleTypeDef *hmdma)
{
  XSPI_HandleTypeDef *hxspi = (XSPI_HandleTypeDef *)(hmdma->Parent);
  hxspi->XferCount = 0U;

  /* Enable the XSPI transfer complete Interrupt */
  HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TC);
}

/**
  * @brief  DMA XSPI communication error callback.
  * @param  hmdma MDMA handle
  * @retval None
  */
static void XSPI_DMAError(MDMA_HandleTypeDef *hmdma)
{
  XSPI_HandleTypeDef *hxspi = (XSPI_HandleTypeDef *)(hmdma->Parent);

  hxspi->XferCount = 0U;
  hxspi->XferCount = 0U;
  hxspi->ErrorCode   |= HAL_XSPI_ERROR_DMA;

  /* Disable the MDMA transfer by clearing the DMAEN bit in the XSPI CR register */
  CLEAR_BIT(hxspi->Instance->CR, QUADSPI_CR_DMAEN);

  /* Abort the XSPI */
  (void)HAL_XSPI_Abort_IT(hxspi);

}

/**
  * @brief  MDMA XSPI abort complete callback.
  * @param  hmdma MDMA handle
  * @retval None
  */
static void XSPI_DMAAbortCplt(MDMA_HandleTypeDef *hmdma)
{
  XSPI_HandleTypeDef *hxspi = (XSPI_HandleTypeDef *)(hmdma->Parent);

  hxspi->XferCount = 0U;
  hxspi->XferCount = 0U;

  if (hxspi->State == HAL_XSPI_STATE_ABORT)
  {
    /* MDMA Abort called by XSPI abort */
    /* Clear interrupt */
    HAL_XSPI_CLEAR_FLAG(hxspi, XSPI_FLAG_TC);

