zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_xspi.c
    /* Enable the XSPI Transfer Complete Interrupt */
    HAL_XSPI_ENABLE_IT(hxspi, XSPI_IT_TC);

    /* Configure XSPI: CR register with Abort request */
    SET_BIT(hxspi->Instance->CR, QUADSPI_CR_ABORT);
  }
  else
  {
    /* MDMA Abort called due to a transfer error interrupt */
    /* Change state of XSPI */
    hxspi->State = HAL_XSPI_STATE_READY;

    /* Error callback */
#if defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
    hxspi->ErrorCallback(hxspi);
#else
    HAL_XSPI_ErrorCallback(hxspi);
#endif /* defined (USE_HAL_XSPI_REGISTER_CALLBACKS) && (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U) */
  }
}

/**
  * @brief  Wait for a flag state until timeout.
  * @param  hxspi XSPI handle
  * @param  Flag Flag checked
  * @param  State Value of the flag expected
  * @param  Tickstart Tick start value
  * @param  Timeout Duration of the timeout
  * @retval HAL status
  */
static HAL_StatusTypeDef XSPI_WaitFlagStateUntilTimeout(XSPI_HandleTypeDef *hxspi, uint32_t Flag,
                                                        FlagStatus State, uint32_t Tickstart, uint32_t Timeout)
{
  /* Wait until flag is in expected state */
  while ((HAL_XSPI_GET_FLAG(hxspi, Flag)) != State)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
      {
        hxspi->State     = HAL_XSPI_STATE_ERROR;
        hxspi->ErrorCode |= HAL_XSPI_ERROR_TIMEOUT;

        return HAL_ERROR;
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Configure the communication registers.
  * @param  hxspi XSPI handle
  * @param  cmd structure that contains the command configuration information
  * @param  FunctionalMode functional mode to configured
  *           This parameter can be one of the following values:
  *            @arg XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE: Indirect write mode
  *            @arg XSPI_FUNCTIONAL_MODE_INDIRECT_READ: Indirect read mode
  *            @arg XSPI_FUNCTIONAL_MODE_AUTO_POLLING: Automatic polling mode
  *            @arg XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED: Memory-mapped mode
  * @retval None
  */
static void XSPI_Config(XSPI_HandleTypeDef *hxspi, XSPI_RegularCmdTypeDef *cmd, uint32_t FunctionalMode)
{
  assert_param(IS_XSPI_FUNCTIONAL_MODE(FunctionalMode));

  if ((cmd->DataMode != XSPI_DATA_NONE) && (FunctionalMode != XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED))
  {
    /* Configure XSPI: DLR register with the number of data to read or write */
    WRITE_REG(hxspi->Instance->DLR, (cmd->DataLength - 1U));
  }

  if (cmd->InstructionMode != XSPI_INSTRUCTION_NONE)
  {
    if (cmd->AlternateByteMode != XSPI_ALT_BYTES_NONE)
    {
      /* Configure XSPI: ABR register with alternate bytes value */
      WRITE_REG(hxspi->Instance->ABR, cmd->AlternateBytes);

      if (cmd->AddressMode != XSPI_ADDRESS_NONE)
      {
        /*---- Command with instruction, address and alternate bytes ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateBytesWidth | cmd->AlternateByteMode |
                                         cmd->AddressWidth | cmd->AddressMode | cmd->InstructionMode |
                                         cmd->Instruction | FunctionalMode));

        if (FunctionalMode != XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
        {
          /* Configure XSPI: AR register with address value */
          WRITE_REG(hxspi->Instance->AR, cmd->Address);
        }
      }
      else
      {
        /*---- Command with instruction and alternate bytes ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateBytesWidth | cmd->AlternateByteMode |
                                         cmd->AddressMode | cmd->InstructionMode |
                                         cmd->Instruction | FunctionalMode));
      }
    }
    else
    {
      if (cmd->AddressMode != XSPI_ADDRESS_NONE)
      {
        /*---- Command with instruction and address ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateByteMode | cmd->AddressWidth | cmd->AddressMode |
                                         cmd->InstructionMode | cmd->Instruction | FunctionalMode));

        if (FunctionalMode != XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
        {
          /* Configure XSPI: AR register with address value */
          WRITE_REG(hxspi->Instance->AR, cmd->Address);
        }
      }
      else
      {
        /*---- Command with only instruction ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateByteMode | cmd->AddressMode |
                                         cmd->InstructionMode | cmd->Instruction | FunctionalMode));
      }
    }
  }
  else
  {
    if (cmd->AlternateByteMode != XSPI_ALT_BYTES_NONE)
    {
      /* Configure XSPI: ABR register with alternate bytes value */
      WRITE_REG(hxspi->Instance->ABR, cmd->AlternateBytes);

      if (cmd->AddressMode != XSPI_ADDRESS_NONE)
      {
        /*---- Command with address and alternate bytes ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateBytesWidth | cmd->AlternateByteMode |
                                         cmd->AddressWidth | cmd->AddressMode |
                                         cmd->InstructionMode | FunctionalMode));

        if (FunctionalMode != XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
        {
          /* Configure XSPI: AR register with address value */
          WRITE_REG(hxspi->Instance->AR, cmd->Address);
        }
      }
      else
      {
        /*---- Command with only alternate bytes ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateBytesWidth | cmd->AlternateByteMode |
                                         cmd->AddressMode | cmd->InstructionMode | FunctionalMode));
      }
    }
    else
    {
      if (cmd->AddressMode != XSPI_ADDRESS_NONE)
      {
        /*---- Command with only address ----*/
        /* Configure XSPI: CCR register with all communications parameters */
        WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                         cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                         cmd->AlternateByteMode | cmd->AddressWidth |
                                         cmd->AddressMode | cmd->InstructionMode | FunctionalMode));

        if (FunctionalMode != XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
        {
          /* Configure XSPI: AR register with address value */
          WRITE_REG(hxspi->Instance->AR, cmd->Address);
        }
      }
      else
      {
        /*---- Command with only data phase ----*/
        if (cmd->DataMode != XSPI_DATA_NONE)
        {
          /* Configure XSPI: CCR register with all communications parameters */
          WRITE_REG(hxspi->Instance->CCR, (cmd->DTRMode | cmd->DelayHoldHalfCycle | cmd->SIOOMode |
                                           cmd->DataMode | (cmd->DummyCycles << QUADSPI_CCR_DCYC_Pos) |
                                           cmd->AlternateByteMode | cmd->AddressMode |
                                           cmd->InstructionMode | FunctionalMode));
        }
      }
    }
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_XSPI_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(XSPI) */
